In [1]:
import numpy as np 
import pandas as pd

In [11]:
df =pd.DataFrame({
    'sex':['m', 'f','f',  'd', '?'] ,
     'age' : [29, 30, 32, 290, 23]}) 
df

  sex  age
0   m   29
1   f   30
2   f   32
3   d  290
4   ?   23

In [13]:
df['sex' ].unique()

array(['m', 'f', 'd', '?'], dtype=object)

In [15]:
df['sex'].value_counts()

sex
f    2
m    1
d    1
?    1
Name: count, dtype: int64

In [8]:
df['sex'].replace({'d' , 'f'})
#df['sex'].replace({'d': 'f'}, inplace=True)

NameError: name 'df' is not defined

In [21]:
df['sex'].replace({'d': 'f' , 'n' :'m'}) # there is no n before therefore no change

0    m
1    f
2    f
3    f
4    ?
Name: sex, dtype: object

In [23]:
df.replace({ 
           'sex' : {
               'd' :'f', 
               'n' : 'm', 
           } ,
      'age' :{
          290 : 29 } })

  sex  age
0   m   29
1   f   30
2   f   32
3   f   29
4   ?   23

In [25]:
df[df['age']> 100]

  sex  age
3   d  290

In [27]:
# we can now just divide by 10 
df.loc[df['age'] >100 , 'age' ] = df.loc[df['age' ] >100 , 'age']/10

In [29]:
df

  sex  age
0   m   29
1   f   30
2   f   32
3   d   29
4   ?   23

In [31]:
#duplicates

In [8]:
import numpy as np
import pandas as pd

In [10]:

ambassadors= pd.Series([
    'france', 'united kingdom','united kingdom', 'italy', 'germany',
    'germany', 'germany' , ] ,
                       index= [
                           'ara', 'dar' ,'peter west' , 'varr',' peter wit', 'peter amm', 'sch'])

In [18]:
ambassadors

ara                    france
dar           united kingdom
peter west     united kingdom
varr                    italy
 peter wit            germany
peter amm             germany
sch                   germany
dtype: object

In [28]:
ambassadors.duplicated() # even spaces in the country names also matter while checking
# here the default is that it is going from top to down and if duplicate found it is marking true

ara           False
dar           False
peter west     True
varr          False
 peter wit    False
peter amm      True
sch            True
dtype: bool

In [32]:
ambassadors.duplicated(keep='last') #in this case it is going from down to top

ara           False
dar            True
peter west    False
varr          False
 peter wit     True
peter amm      True
sch           False
dtype: bool

In [38]:
ambassadors.duplicated(keep= False) # here non duplicated terms as false

ara           False
dar            True
peter west     True
varr          False
 peter wit     True
peter amm      True
sch            True
dtype: bool

In [40]:
ambassadors.drop_duplicates()

ara                   france
dar           united kingdom
varr                   italy
 peter wit           germany
dtype: object

In [42]:
ambassadors.drop_duplicates(keep='last')

ara                   france
peter west    united kingdom
varr                   italy
sch                  germany
dtype: object

In [44]:
ambassadors.drop_duplicates(keep =False)

ara     france
varr     italy
dtype: object

In [20]:
 players= pd.DataFrame({
     'name' :['kobe' , 'lebron', 'kobe', 'carmelo', 'kobe',] ,
    'pos' : ['sg','sf','sg','sf', 'sf',]})

In [54]:
players

      name pos
0     kobe  sg
1   lebron  sf
2     kobe  sg
3  carmelo  sf
4     kobe  sf

In [14]:
import pandas as pd 
import numpy as np

In [22]:
players.duplicated()  # here only if name and pos matches then only it is showing true

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [24]:
players.duplicated(subset=['name']) # here only based on name , if name matches then it is duplicated

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [62]:
players.duplicated(subset=['name'] , keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [64]:
players.drop_duplicates()

      name pos
0     kobe  sg
1   lebron  sf
3  carmelo  sf
4     kobe  sf

In [66]:
players.drop_duplicates(keep='last')

      name pos
1   lebron  sf
2     kobe  sg
3  carmelo  sf
4     kobe  sf

In [68]:
players.drop_duplicates(subset='name')

      name pos
0     kobe  sg
1   lebron  sf
3  carmelo  sf

In [70]:
## splitting of columns

In [28]:
df=pd.DataFrame({
     'data' : ['1987_m_us_1' , 
               '1990?_m_uk_1',
               '1992_f_us_2',
               '1970?_m_  it_2',
               '1985_f_i  t_2']})

In [79]:
df

             data
0     1987_m_us_1
1    1990?_m_uk_1
2     1992_f_us_2
3  1970?_m_  it_2
4   1985_f_i  t_2

In [83]:
df['data'].str.split('_')

0       [1987, m, us, 1]
1      [1990?, m, uk, 1]
2       [1992, f, us, 2]
3    [1970?, m,   it, 2]
4     [1985, f, i  t, 2]
Name: data, dtype: object

In [85]:
df['data'].str.split('_', expand=True)

       0  1     2  3
0   1987  m    us  1
1  1990?  m    uk  1
2   1992  f    us  2
3  1970?  m    it  2
4   1985  f  i  t  2

In [30]:
df=df['data'].str.split('_', expand=True)

In [91]:
df

       0  1     2  3
0   1987  m    us  1
1  1990?  m    uk  1
2   1992  f    us  2
3  1970?  m    it  2
4   1985  f  i  t  2

In [93]:
df.columns=['year', 'sex', 'country', 'no children']

In [95]:
df

    year sex country no children
0   1987   m      us           1
1  1990?   m      uk           1
2   1992   f      us           2
3  1970?   m      it           2
4   1985   f    i  t           2

In [107]:
df['year'].str.contains('\?')

<>:1: SyntaxWarning: invalid escape sequence '\?'
<>:1: SyntaxWarning: invalid escape sequence '\?'
C:\Users\udayk\AppData\Local\Temp\ipykernel_35580\294902769.py:1: SyntaxWarning: invalid escape sequence '\?'
  df['year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: year, dtype: bool

In [111]:
df['country'].str.strip() #removes leading or trailing whitespaces

0      us
1      uk
2      us
3      it
4    i  t
Name: country, dtype: object

In [115]:
df['country'].str.replace(' ', '')

0    us
1    uk
2    us
3    it
4    it
Name: country, dtype: object